
a = 4.52
b = 5.24
h = 12.46

M = ( ( ( a + b ) * ( h ** 2 ) ) / 4 ) + ( ( ( a + b ) * h ) / 12 )

'''
    Действие 1: h ^ 2 = 12,46 ^ 2 = 155,2516 = 155,251
    Действие 2: a + b = 4,52 + 5,24 = 9,76
    Действие 3: (Действие 2) * (Действие 1) = 9,76 * 155,251 = 1515,24976 = 1515,25
    Действие 4: (Действие 3) / 4 = 1515,25 / 4 = 378,81225 = 379
    Действие 5: (Действие 2) * h = 9,76 * 12,46 = 121,6096 = 121,61 
    Действие 6: (Действие 5) / 12 = 121,61 / 12 = 10,13416 = 10
    Действие 7: (Действие 4) + (Действие 6) = 379 + 10 = 389
'''
print("Значение выражение: М = 389")
print(f"Проверка выражения М = {M}")